nxp-mcuxpresso/mcux-soc-svd/MIMXRT1051/MIMXRT1051.xml
        <register>
          <name>GPR2</name>
          <description>GPR2 General Purpose Register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>L2_MEM_EN_POWERSAVING</name>
              <description>Enable power saving features on memory</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>L2_MEM_EN_POWERSAVING_0</name>
                  <description>Enters power saving mode only when chip is in SUSPEND mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>L2_MEM_EN_POWERSAVING_1</name>
                  <description>Controlled by L2_MEM_DEEPSLEEP bitfield</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>L2_MEM_DEEPSLEEP</name>
              <description>This bit controls how memory (OCRAM) enters Deep Sleep mode (shutdown periphery power, but maintain memory contents, outputs of memory are pulled low)</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>L2_MEM_DEEPSLEEP_0</name>
                  <description>No force sleep control supported, memory deep sleep mode only entered when whole system in stop mode (OCRAM in normal mode)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>L2_MEM_DEEPSLEEP_1</name>
                  <description>Force memory into deep sleep mode (OCRAM in power saving mode)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MQS_CLK_DIV</name>
              <description>Divider ratio control for mclk from hmclk. mclk frequency = 1/(n+1) * hmclk frequency.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIVIDE_1</name>
                  <description>mclk frequency = 1/1 * hmclk frequency</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_2</name>
                  <description>mclk frequency = 1/2 * hmclk frequency</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_3</name>
                  <description>mclk frequency = 1/3 * hmclk frequency</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_4</name>
                  <description>mclk frequency = 1/4 * hmclk frequency</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_5</name>
                  <description>mclk frequency = 1/5 * hmclk frequency</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_6</name>
                  <description>mclk frequency = 1/6 * hmclk frequency</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_7</name>
                  <description>mclk frequency = 1/7 * hmclk frequency</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_8</name>
                  <description>mclk frequency = 1/8 * hmclk frequency</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_9</name>
                  <description>mclk frequency = 1/9 * hmclk frequency</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_10</name>
                  <description>mclk frequency = 1/10 * hmclk frequency</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_11</name>
                  <description>mclk frequency = 1/11 * hmclk frequency</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_12</name>
                  <description>mclk frequency = 1/12 * hmclk frequency</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_13</name>
                  <description>mclk frequency = 1/13 * hmclk frequency</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_14</name>
                  <description>mclk frequency = 1/14 * hmclk frequency</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_15</name>
                  <description>mclk frequency = 1/15 * hmclk frequency</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_16</name>
                  <description>mclk frequency = 1/16 * hmclk frequency</description>
                  <value>0xF</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_17</name>
                  <description>mclk frequency = 1/17 * hmclk frequency</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_18</name>
                  <description>mclk frequency = 1/18 * hmclk frequency</description>
                  <value>0x11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_19</name>
                  <description>mclk frequency = 1/19 * hmclk frequency</description>
                  <value>0x12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_20</name>
                  <description>mclk frequency = 1/20 * hmclk frequency</description>
                  <value>0x13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_21</name>
                  <description>mclk frequency = 1/21 * hmclk frequency</description>
                  <value>0x14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_22</name>
                  <description>mclk frequency = 1/22 * hmclk frequency</description>
                  <value>0x15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_23</name>
                  <description>mclk frequency = 1/23 * hmclk frequency</description>
                  <value>0x16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_24</name>
                  <description>mclk frequency = 1/24 * hmclk frequency</description>
                  <value>0x17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_25</name>
                  <description>mclk frequency = 1/25 * hmclk frequency</description>
                  <value>0x18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_26</name>
                  <description>mclk frequency = 1/26 * hmclk frequency</description>
                  <value>0x19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_27</name>
                  <description>mclk frequency = 1/27 * hmclk frequency</description>
                  <value>0x1A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_28</name>
                  <description>mclk frequency = 1/28 * hmclk frequency</description>
                  <value>0x1B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_29</name>
                  <description>mclk frequency = 1/29 * hmclk frequency</description>
                  <value>0x1C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_30</name>
                  <description>mclk frequency = 1/30 * hmclk frequency</description>
                  <value>0x1D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_31</name>
                  <description>mclk frequency = 1/31 * hmclk frequency</description>
                  <value>0x1E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_32</name>
                  <description>mclk frequency = 1/32 * hmclk frequency</description>
                  <value>0x1F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_33</name>
                  <description>mclk frequency = 1/33 * hmclk frequency</description>
                  <value>0x20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_34</name>
                  <description>mclk frequency = 1/34 * hmclk frequency</description>
                  <value>0x21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_35</name>
                  <description>mclk frequency = 1/35 * hmclk frequency</description>
                  <value>0x22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_36</name>
                  <description>mclk frequency = 1/36 * hmclk frequency</description>
                  <value>0x23</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_37</name>
                  <description>mclk frequency = 1/37 * hmclk frequency</description>
                  <value>0x24</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_38</name>
                  <description>mclk frequency = 1/38 * hmclk frequency</description>
                  <value>0x25</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_39</name>
                  <description>mclk frequency = 1/39 * hmclk frequency</description>
                  <value>0x26</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_40</name>
                  <description>mclk frequency = 1/40 * hmclk frequency</description>
                  <value>0x27</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_41</name>
                  <description>mclk frequency = 1/41 * hmclk frequency</description>
                  <value>0x28</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_42</name>
                  <description>mclk frequency = 1/42 * hmclk frequency</description>
                  <value>0x29</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_43</name>
                  <description>mclk frequency = 1/43 * hmclk frequency</description>
                  <value>0x2A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_44</name>
                  <description>mclk frequency = 1/44 * hmclk frequency</description>
                  <value>0x2B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_45</name>
                  <description>mclk frequency = 1/45 * hmclk frequency</description>
                  <value>0x2C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_46</name>
                  <description>mclk frequency = 1/46 * hmclk frequency</description>
                  <value>0x2D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_47</name>
                  <description>mclk frequency = 1/47 * hmclk frequency</description>
                  <value>0x2E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_48</name>
                  <description>mclk frequency = 1/48 * hmclk frequency</description>
                  <value>0x2F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_49</name>
                  <description>mclk frequency = 1/49 * hmclk frequency</description>
                  <value>0x30</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_50</name>
                  <description>mclk frequency = 1/50 * hmclk frequency</description>
                  <value>0x31</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_51</name>
                  <description>mclk frequency = 1/51 * hmclk frequency</description>
                  <value>0x32</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_52</name>
                  <description>mclk frequency = 1/52 * hmclk frequency</description>
                  <value>0x33</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_53</name>
                  <description>mclk frequency = 1/53 * hmclk frequency</description>
                  <value>0x34</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_54</name>
                  <description>mclk frequency = 1/54 * hmclk frequency</description>
                  <value>0x35</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_55</name>
                  <description>mclk frequency = 1/55 * hmclk frequency</description>
                  <value>0x36</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_56</name>
                  <description>mclk frequency = 1/56 * hmclk frequency</description>
                  <value>0x37</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_57</name>
                  <description>mclk frequency = 1/57 * hmclk frequency</description>
                  <value>0x38</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_58</name>
                  <description>mclk frequency = 1/58 * hmclk frequency</description>
                  <value>0x39</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_59</name>
                  <description>mclk frequency = 1/59 * hmclk frequency</description>
                  <value>0x3A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_60</name>
                  <description>mclk frequency = 1/60 * hmclk frequency</description>
                  <value>0x3B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_61</name>
                  <description>mclk frequency = 1/61 * hmclk frequency</description>
                  <value>0x3C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_62</name>
                  <description>mclk frequency = 1/62 * hmclk frequency</description>
                  <value>0x3D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_63</name>
                  <description>mclk frequency = 1/63 * hmclk frequency</description>
                  <value>0x3E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_64</name>
                  <description>mclk frequency = 1/64 * hmclk frequency</description>
                  <value>0x3F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_65</name>
                  <description>mclk frequency = 1/65 * hmclk frequency</description>
                  <value>0x40</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_66</name>
                  <description>mclk frequency = 1/66 * hmclk frequency</description>
                  <value>0x41</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_67</name>
                  <description>mclk frequency = 1/67 * hmclk frequency</description>
                  <value>0x42</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_68</name>
                  <description>mclk frequency = 1/68 * hmclk frequency</description>
                  <value>0x43</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_69</name>
                  <description>mclk frequency = 1/69 * hmclk frequency</description>
                  <value>0x44</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_70</name>
                  <description>mclk frequency = 1/70 * hmclk frequency</description>
                  <value>0x45</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_71</name>
                  <description>mclk frequency = 1/71 * hmclk frequency</description>
                  <value>0x46</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_72</name>
                  <description>mclk frequency = 1/72 * hmclk frequency</description>
                  <value>0x47</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_73</name>
                  <description>mclk frequency = 1/73 * hmclk frequency</description>
                  <value>0x48</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_74</name>
                  <description>mclk frequency = 1/74 * hmclk frequency</description>
                  <value>0x49</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_75</name>
                  <description>mclk frequency = 1/75 * hmclk frequency</description>
                  <value>0x4A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_76</name>
                  <description>mclk frequency = 1/76 * hmclk frequency</description>
                  <value>0x4B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_77</name>
                  <description>mclk frequency = 1/77 * hmclk frequency</description>
                  <value>0x4C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_78</name>
                  <description>mclk frequency = 1/78 * hmclk frequency</description>
                  <value>0x4D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_79</name>
                  <description>mclk frequency = 1/79 * hmclk frequency</description>
                  <value>0x4E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_80</name>
                  <description>mclk frequency = 1/80 * hmclk frequency</description>
                  <value>0x4F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_81</name>
                  <description>mclk frequency = 1/81 * hmclk frequency</description>
                  <value>0x50</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_82</name>
                  <description>mclk frequency = 1/82 * hmclk frequency</description>
                  <value>0x51</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_83</name>
                  <description>mclk frequency = 1/83 * hmclk frequency</description>
                  <value>0x52</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_84</name>
                  <description>mclk frequency = 1/84 * hmclk frequency</description>
                  <value>0x53</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_85</name>
                  <description>mclk frequency = 1/85 * hmclk frequency</description>
                  <value>0x54</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_86</name>
                  <description>mclk frequency = 1/86 * hmclk frequency</description>
                  <value>0x55</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_87</name>
                  <description>mclk frequency = 1/87 * hmclk frequency</description>
                  <value>0x56</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_88</name>
                  <description>mclk frequency = 1/88 * hmclk frequency</description>
                  <value>0x57</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_89</name>
                  <description>mclk frequency = 1/89 * hmclk frequency</description>
                  <value>0x58</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_90</name>
                  <description>mclk frequency = 1/90 * hmclk frequency</description>
                  <value>0x59</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_91</name>
                  <description>mclk frequency = 1/91 * hmclk frequency</description>
                  <value>0x5A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_92</name>
                  <description>mclk frequency = 1/92 * hmclk frequency</description>
                  <value>0x5B</value>
                </enumeratedValue>
