nxp-mcuxpresso/mcux-soc-svd/MIMXRT1051/MIMXRT1051.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>TEMPMON</name>
      <description>Temperature Monitor</description>
      <alternatePeripheral>CCM_ANALOG</alternatePeripheral>
      <groupName>TEMPMON</groupName>
      <prependToName>TEMPMON_</prependToName>
      <baseAddress>0x400D8000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x2A0</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>TEMP_LOW_HIGH</name>
        <value>63</value>
      </interrupt>
      <interrupt>
        <name>TEMP_PANIC</name>
        <value>64</value>
      </interrupt>
      <registers>
        <register>
          <name>TEMPSENSE0</name>
          <description>Tempsensor Control Register 0</description>
          <addressOffset>0x180</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>POWER_DOWN</name>
              <description>This bit powers down the temperature sensor.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POWER_UP</name>
                  <description>Enable power to the temperature sensor.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POWER_DOWN</name>
                  <description>Power down the temperature sensor.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MEASURE_TEMP</name>
              <description>Starts the measurement process</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STOP</name>
                  <description>Do not start the measurement process.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>START</name>
                  <description>Start the measurement process.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FINISHED</name>
              <description>Indicates that the latest temp is valid</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INVALID</name>
                  <description>Last measurement is not ready yet.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VALID</name>
                  <description>Last measurement is valid.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TEMP_CNT</name>
              <description>This bit field contains the last measured temperature count.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ALARM_VALUE</name>
              <description>This bit field contains the temperature count (raw sensor output) that will generate a high alarm when TEMP_CNT is smaller than this field</description>
              <bitOffset>20</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TEMPSENSE0_SET</name>
          <description>Tempsensor Control Register 0</description>
          <addressOffset>0x184</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>POWER_DOWN</name>
              <description>This bit powers down the temperature sensor.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POWER_UP</name>
                  <description>Enable power to the temperature sensor.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POWER_DOWN</name>
                  <description>Power down the temperature sensor.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MEASURE_TEMP</name>
              <description>Starts the measurement process</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STOP</name>
                  <description>Do not start the measurement process.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>START</name>
                  <description>Start the measurement process.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FINISHED</name>
              <description>Indicates that the latest temp is valid</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INVALID</name>
                  <description>Last measurement is not ready yet.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VALID</name>
                  <description>Last measurement is valid.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TEMP_CNT</name>
              <description>This bit field contains the last measured temperature count.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ALARM_VALUE</name>
              <description>This bit field contains the temperature count (raw sensor output) that will generate a high alarm when TEMP_CNT is smaller than this field</description>
              <bitOffset>20</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TEMPSENSE0_CLR</name>
          <description>Tempsensor Control Register 0</description>
          <addressOffset>0x188</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>POWER_DOWN</name>
              <description>This bit powers down the temperature sensor.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POWER_UP</name>
                  <description>Enable power to the temperature sensor.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POWER_DOWN</name>
                  <description>Power down the temperature sensor.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MEASURE_TEMP</name>
              <description>Starts the measurement process</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STOP</name>
                  <description>Do not start the measurement process.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>START</name>
                  <description>Start the measurement process.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FINISHED</name>
              <description>Indicates that the latest temp is valid</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INVALID</name>
                  <description>Last measurement is not ready yet.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VALID</name>
                  <description>Last measurement is valid.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TEMP_CNT</name>
              <description>This bit field contains the last measured temperature count.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ALARM_VALUE</name>
              <description>This bit field contains the temperature count (raw sensor output) that will generate a high alarm when TEMP_CNT is smaller than this field</description>
              <bitOffset>20</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TEMPSENSE0_TOG</name>
          <description>Tempsensor Control Register 0</description>
          <addressOffset>0x18C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>POWER_DOWN</name>
              <description>This bit powers down the temperature sensor.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POWER_UP</name>
                  <description>Enable power to the temperature sensor.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POWER_DOWN</name>
                  <description>Power down the temperature sensor.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MEASURE_TEMP</name>
              <description>Starts the measurement process</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STOP</name>
                  <description>Do not start the measurement process.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>START</name>
                  <description>Start the measurement process.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FINISHED</name>
              <description>Indicates that the latest temp is valid</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INVALID</name>
                  <description>Last measurement is not ready yet.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VALID</name>
                  <description>Last measurement is valid.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TEMP_CNT</name>
              <description>This bit field contains the last measured temperature count.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ALARM_VALUE</name>
              <description>This bit field contains the temperature count (raw sensor output) that will generate a high alarm when TEMP_CNT is smaller than this field</description>
              <bitOffset>20</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TEMPSENSE1</name>
          <description>Tempsensor Control Register 1</description>
          <addressOffset>0x190</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MEASURE_FREQ</name>
              <description>This bits determines how many RTC clocks to wait before automatically repeating a temperature measurement</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MEASURE_FREQ_0</name>
                  <description>Defines a single measurement with no repeat.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MEASURE_FREQ_1</name>
                  <description>Updates the temperature value at a RTC clock rate.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MEASURE_FREQ_2</name>
                  <description>Updates the temperature value at a RTC/2 clock rate.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MEASURE_FREQ_65535</name>
                  <description>Determines a two second sample period with a 32.768KHz RTC clock. Exact timings depend on the accuracy of the RTC clock.</description>
                  <value>0xFFFF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TEMPSENSE1_SET</name>
          <description>Tempsensor Control Register 1</description>
          <addressOffset>0x194</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MEASURE_FREQ</name>
              <description>This bits determines how many RTC clocks to wait before automatically repeating a temperature measurement</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MEASURE_FREQ_0</name>
                  <description>Defines a single measurement with no repeat.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MEASURE_FREQ_1</name>
                  <description>Updates the temperature value at a RTC clock rate.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MEASURE_FREQ_2</name>
                  <description>Updates the temperature value at a RTC/2 clock rate.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MEASURE_FREQ_65535</name>
                  <description>Determines a two second sample period with a 32.768KHz RTC clock. Exact timings depend on the accuracy of the RTC clock.</description>
                  <value>0xFFFF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TEMPSENSE1_CLR</name>
          <description>Tempsensor Control Register 1</description>
          <addressOffset>0x198</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MEASURE_FREQ</name>
              <description>This bits determines how many RTC clocks to wait before automatically repeating a temperature measurement</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MEASURE_FREQ_0</name>
                  <description>Defines a single measurement with no repeat.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MEASURE_FREQ_1</name>
                  <description>Updates the temperature value at a RTC clock rate.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MEASURE_FREQ_2</name>
                  <description>Updates the temperature value at a RTC/2 clock rate.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MEASURE_FREQ_65535</name>
                  <description>Determines a two second sample period with a 32.768KHz RTC clock. Exact timings depend on the accuracy of the RTC clock.</description>
                  <value>0xFFFF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TEMPSENSE1_TOG</name>
          <description>Tempsensor Control Register 1</description>
          <addressOffset>0x19C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MEASURE_FREQ</name>
              <description>This bits determines how many RTC clocks to wait before automatically repeating a temperature measurement</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MEASURE_FREQ_0</name>
                  <description>Defines a single measurement with no repeat.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MEASURE_FREQ_1</name>
                  <description>Updates the temperature value at a RTC clock rate.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MEASURE_FREQ_2</name>
                  <description>Updates the temperature value at a RTC/2 clock rate.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MEASURE_FREQ_65535</name>
                  <description>Determines a two second sample period with a 32.768KHz RTC clock. Exact timings depend on the accuracy of the RTC clock.</description>
                  <value>0xFFFF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TEMPSENSE2</name>
          <description>Tempsensor Control Register 2</description>
          <addressOffset>0x290</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LOW_ALARM_VALUE</name>
              <description>This bit field contains the temperature count that will generate a low alarm interrupt when the field is exceeded by TEMP_CNT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PANIC_ALARM_VALUE</name>
              <description>This bit field contains the temperature count that will generate a panic interrupt when TEMP_CNT is smaller than this field</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TEMPSENSE2_SET</name>
          <description>Tempsensor Control Register 2</description>
          <addressOffset>0x294</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LOW_ALARM_VALUE</name>
              <description>This bit field contains the temperature count that will generate a low alarm interrupt when the field is exceeded by TEMP_CNT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PANIC_ALARM_VALUE</name>
              <description>This bit field contains the temperature count that will generate a panic interrupt when TEMP_CNT is smaller than this field</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
