nxp-mcuxpresso/mcux-soc-svd/MIMXRT1051/MIMXRT1051.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>TSC</name>
      <description>Touch Screen Controller</description>
      <groupName>TSC</groupName>
      <prependToName>TSC_</prependToName>
      <baseAddress>0x400E0000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x84</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>TSC_DIG</name>
        <value>40</value>
      </interrupt>
      <registers>
        <register>
          <name>BASIC_SETTING</name>
          <description>Basic Setting</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>AUTO_MEASURE</name>
              <description>Auto Measure</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AUTO_MEASURE_0</name>
                  <description>Disable Auto Measure</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUTO_MEASURE_1</name>
                  <description>Auto Measure</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WIRE_4_5</name>
              <description>4/5 Wire detection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WIRE_4_5_0</name>
                  <description>4-Wire Detection Mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIRE_4_5_1</name>
                  <description>5-Wire Detection Mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MEASURE_DELAY_TIME</name>
              <description>Measure Delay Time</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRE_CHARGE_TIME</name>
          <description>Pre-charge Time</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PRE_CHARGE_TIME</name>
              <description>Before detection, the top screen needs some time before being pulled up to a high voltage.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLOW_CONTROL</name>
          <description>Flow Control</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SW_RST</name>
              <description>Soft Reset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>START_MEASURE</name>
              <description>Start Measure</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>START_MEASURE_0</name>
                  <description>Do not start measure for now</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>START_MEASURE_1</name>
                  <description>Start measure the X/Y coordinate value</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DROP_MEASURE</name>
              <description>Drop Measure</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DROP_MEASURE_0</name>
                  <description>Do not drop measure for now</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DROP_MEASURE_1</name>
                  <description>Drop the measure and controller return to idle status</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>START_SENSE</name>
              <description>Start Sense</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>START_SENSE_0</name>
                  <description>Stay at idle status</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>START_SENSE_1</name>
                  <description>Start sense detection and (if auto_measure set to 1) measure after detect a touch</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DISABLE</name>
              <description>This bit is for SW disable registers</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE_0</name>
                  <description>Leave HW state machine control</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLE_1</name>
                  <description>SW set to idle status</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MEASEURE_VALUE</name>
          <description>Measure Value</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>Y_VALUE</name>
              <description>Y Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>X_VALUE</name>
              <description>X Value</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_EN</name>
          <description>Interrupt Enable</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MEASURE_INT_EN</name>
              <description>Measure Interrupt Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MEASURE_INT_EN_0</name>
                  <description>Disable measure interrupt</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MEASURE_INT_EN_1</name>
                  <description>Enable measure interrupt</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DETECT_INT_EN</name>
              <description>Detect Interrupt Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DETECT_INT_EN_0</name>
                  <description>Disable detect interrupt</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DETECT_INT_EN_1</name>
                  <description>Enable detect interrupt</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IDLE_SW_INT_EN</name>
              <description>Idle Software Interrupt Enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IDLE_SW_INT_EN_0</name>
                  <description>Disable idle software interrupt</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IDLE_SW_INT_EN_1</name>
                  <description>Enable idle software interrupt</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_SIG_EN</name>
          <description>Interrupt Signal Enable</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MEASURE_SIG_EN</name>
              <description>Measure Signal Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DETECT_SIG_EN</name>
              <description>Detect Signal Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DETECT_SIG_EN_0</name>
                  <description>Disable detect signal</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DETECT_SIG_EN_1</name>
                  <description>Enable detect signal</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VALID_SIG_EN</name>
              <description>Valid Signal Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VALID_SIG_EN_0</name>
                  <description>Disable valid signal</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VALID_SIG_EN_1</name>
                  <description>Enable valid signal</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IDLE_SW_SIG_EN</name>
              <description>Idle Software Signal Enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IDLE_SW_SIG_EN_0</name>
                  <description>Disable idle software signal</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IDLE_SW_SIG_EN_1</name>
                  <description>Enable idle software signal</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_STATUS</name>
          <description>Intterrupt Status</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MEASURE</name>
              <description>Measure Signal</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MEASURE_0</name>
                  <description>Does not exist a measure signal</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MEASURE_1</name>
                  <description>Exist a measure signal</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DETECT</name>
              <description>Detect Signal</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DETECT_0</name>
                  <description>Does not exist a detect signal</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DETECT_1</name>
                  <description>Exist detect signal</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VALID</name>
              <description>Valid Signal</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VALID_0</name>
                  <description>There is no touch detected after measurement, indicates that the measured value is not valid</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VALID_1</name>
                  <description>There is touch detection after measurement, indicates that the measure is valid</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IDLE_SW</name>
              <description>Idle Software</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IDLE_SW_0</name>
                  <description>Haven't return to idle status</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IDLE_SW_1</name>
                  <description>Already return to idle status</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DEBUG_MODE</name>
          <description>Debug Mode Register</description>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ADC_CONV_VALUE</name>
              <description>ADC Conversion Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ADC_COCO</name>
              <description>ADC COCO Signal</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EXT_HWTS</name>
              <description>Hardware Trigger Select Signal</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIGGER</name>
              <description>Trigger</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRIGGER_0</name>
                  <description>No hardware trigger signal</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIGGER_1</name>
                  <description>Hardware trigger signal, the signal must last at least 1 ips clock period</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC_COCO_CLEAR</name>
              <description>ADC Coco Clear</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_COCO_CLEAR_0</name>
                  <description>No ADC COCO clear</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_COCO_CLEAR_1</name>
                  <description>Set ADC COCO clear</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC_COCO_CLEAR_DISABLE</name>
              <description>ADC COCO Clear Disable</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_COCO_CLEAR_DISABLE_0</name>
                  <description>Allow TSC hardware generates ADC COCO clear</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_COCO_CLEAR_DISABLE_1</name>
                  <description>Prevent TSC from generate ADC COCO clear signal</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DEBUG_EN</name>
              <description>Debug Enable</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEBUG_EN_0</name>
                  <description>Enable debug mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEBUG_EN_1</name>
                  <description>Disable debug mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
