nxp-mcuxpresso/mcux-soc-svd/MIMXRT1051/MIMXRT1051.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>ROMC</name>
      <description>ROMC</description>
      <groupName>ROMC</groupName>
      <prependToName>ROMC_</prependToName>
      <baseAddress>0x40180000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x20C</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <dim>8</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>7,6,5,4,3,2,1,0</dimIndex>
          <name>ROMPATCH%sD</name>
          <description>ROMC Data Registers</description>
          <addressOffset>0xD4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATAX</name>
              <description>Data Fix Registers - Stores the data used for 1-word data fix operations</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ROMPATCHCNTL</name>
          <description>ROMC Control Register</description>
          <addressOffset>0xF4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x8400000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATAFIX</name>
              <description>Data Fix Enable - Controls the use of the first 8 address comparators for 1-word data fix or for code patch routine</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DATAFIX_0</name>
                  <description>Address comparator triggers a opcode patch</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATAFIX_1</name>
                  <description>Address comparator triggers a data fix</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIS</name>
              <description>ROMC Disable -- This bit, when set, disables all ROMC operations</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS_0</name>
                  <description>Does not affect any ROMC functions (default)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS_1</name>
                  <description>Disable all ROMC functions: data fixing, and opcode patching</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ROMPATCHENH</name>
          <description>ROMC Enable Register High</description>
          <addressOffset>0xF8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>ROMPATCHENL</name>
          <description>ROMC Enable Register Low</description>
          <addressOffset>0xFC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>Enable Address Comparator - This bit enables the corresponding address comparator to trigger an event</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLE_0</name>
                  <description>Address comparator disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE_1</name>
                  <description>Address comparator enabled, ROMC will trigger a opcode patch or data fix event upon matching of the associated address</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>16</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15</dimIndex>
          <name>ROMPATCH%sA</name>
          <description>ROMC Address Registers</description>
          <addressOffset>0x100</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>THUMBX</name>
              <description>THUMB Comparator Select - Indicates that this address will trigger a THUMB opcode patch or an Arm opcode patch</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>THUMBX_0</name>
                  <description>Arm patch</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THUMBX_1</name>
                  <description>THUMB patch (ignore if data fix)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADDRX</name>
              <description>Address Comparator Registers - Indicates the memory address to be watched</description>
              <bitOffset>1</bitOffset>
              <bitWidth>22</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ROMPATCHSR</name>
          <description>ROMC Status Register</description>
          <addressOffset>0x208</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SOURCE</name>
              <description>ROMC Source Number - Binary encoding of the number of the address comparator which has an address match in the most recent patch event on ROMC AHB</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SOURCE_0</name>
                  <description>Address Comparator 0 matched</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SOURCE_1</name>
                  <description>Address Comparator 1 matched</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SOURCE_15</name>
                  <description>Address Comparator 15 matched</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SW</name>
              <description>ROMC AHB Multiple Address Comparator matches Indicator - Indicates that multiple address comparator matches occurred</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SW_0</name>
                  <description>no event or comparator collisions</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SW_1</name>
                  <description>a collision has occurred</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
