nxp-mcuxpresso/mcux-soc-svd/MIMXRT1051/MIMXRT1051.xml
        <register>
          <name>LPUART4_TX_SELECT_INPUT</name>
          <description>LPUART4_TX_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x544</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_SD_B1_00_ALT4</name>
                  <description>Selecting Pad: GPIO_SD_B1_00 for Mode: ALT4</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_EMC_19_ALT2</name>
                  <description>Selecting Pad: GPIO_EMC_19 for Mode: ALT2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_B1_00_ALT2</name>
                  <description>Selecting Pad: GPIO_B1_00 for Mode: ALT2</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LPUART5_RX_SELECT_INPUT</name>
          <description>LPUART5_RX_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x548</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_EMC_24_ALT2</name>
                  <description>Selecting Pad: GPIO_EMC_24 for Mode: ALT2</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_B1_13_ALT1</name>
                  <description>Selecting Pad: GPIO_B1_13 for Mode: ALT1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LPUART5_TX_SELECT_INPUT</name>
          <description>LPUART5_TX_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x54C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_EMC_23_ALT2</name>
                  <description>Selecting Pad: GPIO_EMC_23 for Mode: ALT2</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_B1_12_ALT1</name>
                  <description>Selecting Pad: GPIO_B1_12 for Mode: ALT1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LPUART6_RX_SELECT_INPUT</name>
          <description>LPUART6_RX_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x550</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_EMC_26_ALT2</name>
                  <description>Selecting Pad: GPIO_EMC_26 for Mode: ALT2</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_AD_B0_03_ALT2</name>
                  <description>Selecting Pad: GPIO_AD_B0_03 for Mode: ALT2</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LPUART6_TX_SELECT_INPUT</name>
          <description>LPUART6_TX_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x554</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_EMC_25_ALT2</name>
                  <description>Selecting Pad: GPIO_EMC_25 for Mode: ALT2</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_AD_B0_02_ALT2</name>
                  <description>Selecting Pad: GPIO_AD_B0_02 for Mode: ALT2</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LPUART7_RX_SELECT_INPUT</name>
          <description>LPUART7_RX_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x558</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_SD_B1_09_ALT2</name>
                  <description>Selecting Pad: GPIO_SD_B1_09 for Mode: ALT2</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_EMC_32_ALT2</name>
                  <description>Selecting Pad: GPIO_EMC_32 for Mode: ALT2</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LPUART7_TX_SELECT_INPUT</name>
          <description>LPUART7_TX_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x55C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_SD_B1_08_ALT2</name>
                  <description>Selecting Pad: GPIO_SD_B1_08 for Mode: ALT2</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_EMC_31_ALT2</name>
                  <description>Selecting Pad:GPIO_EMC_31 for Mode: ALT2</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LPUART8_RX_SELECT_INPUT</name>
          <description>LPUART8_RX_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x560</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_SD_B0_05_ALT2</name>
                  <description>Selecting Pad: GPIO_SD_B0_05 for Mode: ALT2</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_AD_B1_11_ALT2</name>
                  <description>Selecting Pad: GPIO_AD_B1_11 for Mode: ALT2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_EMC_39_ALT2</name>
                  <description>Selecting Pad: GPIO_EMC_39 for Mode: ALT2</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LPUART8_TX_SELECT_INPUT</name>
          <description>LPUART8_TX_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x564</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_SD_B0_04_ALT2</name>
                  <description>Selecting Pad: GPIO_SD_B0_04 for Mode: ALT2</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_AD_B1_10_ALT2</name>
                  <description>Selecting Pad: GPIO_AD_B1_10 for Mode: ALT2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_EMC_38_ALT2</name>
                  <description>Selecting Pad: GPIO_EMC_38 for Mode: ALT2</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>NMI_SELECT_INPUT</name>
          <description>NMI_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x568</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_AD_B0_12_ALT7</name>
                  <description>Selecting Pad: GPIO_AD_B0_12 for Mode: ALT7</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WAKEUP_ALT7</name>
                  <description>Selecting Pad: WAKEUP for Mode: ALT7</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>QTIMER2_TIMER0_SELECT_INPUT</name>
          <description>QTIMER2_TIMER0_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x56C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_EMC_19_ALT4</name>
                  <description>Selecting Pad: GPIO_EMC_19 for Mode: ALT4</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_B0_03_ALT1</name>
                  <description>Selecting Pad: GPIO_B0_03 for Mode: ALT1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>QTIMER2_TIMER1_SELECT_INPUT</name>
          <description>QTIMER2_TIMER1_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x570</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_EMC_20_ALT4</name>
                  <description>Selecting Pad: GPIO_EMC_20 for Mode: ALT4</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_B0_04_ALT1</name>
                  <description>Selecting Pad: GPIO_B0_04 for Mode: ALT1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>QTIMER2_TIMER2_SELECT_INPUT</name>
          <description>QTIMER2_TIMER2_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x574</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_EMC_21_ALT4</name>
                  <description>Selecting Pad: GPIO_EMC_21 for Mode: ALT4</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_B0_05_ALT1</name>
                  <description>Selecting Pad: GPIO_B0_05 for Mode: ALT1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>QTIMER2_TIMER3_SELECT_INPUT</name>
          <description>QTIMER2_TIMER3_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x578</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_EMC_22_ALT4</name>
                  <description>Selecting Pad: GPIO_EMC_22 for Mode: ALT4</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_B1_09_ALT1</name>
                  <description>Selecting Pad: GPIO_B1_09 for Mode: ALT1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>QTIMER3_TIMER0_SELECT_INPUT</name>
          <description>QTIMER3_TIMER0_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x57C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_EMC_15_ALT4</name>
                  <description>Selecting Pad: GPIO_EMC_15 for Mode: ALT4</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_AD_B1_00_ALT1</name>
                  <description>Selecting Pad: GPIO_AD_B1_00 for Mode: ALT1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_B0_06_ALT1</name>
                  <description>Selecting Pad: GPIO_B0_06 for Mode: ALT1</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>QTIMER3_TIMER1_SELECT_INPUT</name>
          <description>QTIMER3_TIMER1_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x580</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_AD_B1_01_ALT1</name>
                  <description>Selecting Pad: GPIO_AD_B1_01 for Mode: ALT1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_EMC_16_ALT4</name>
                  <description>Selecting Pad: GPIO_EMC_16 for Mode: ALT4</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_B0_07_ALT1</name>
                  <description>Selecting Pad: GPIO_B0_07 for Mode: ALT1</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>QTIMER3_TIMER2_SELECT_INPUT</name>
          <description>QTIMER3_TIMER2_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x584</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_EMC_17_ALT4</name>
                  <description>Selecting Pad: GPIO_EMC_17 for Mode: ALT4</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_AD_B1_02_ALT1</name>
                  <description>Selecting Pad: GPIO_AD_B1_02 for Mode: ALT1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_B0_08_ALT1</name>
                  <description>Selecting Pad: GPIO_B0_08 for Mode: ALT1</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>QTIMER3_TIMER3_SELECT_INPUT</name>
          <description>QTIMER3_TIMER3_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x588</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_EMC_18_ALT4</name>
                  <description>Selecting Pad: GPIO_EMC_18 for Mode: ALT4</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_AD_B1_03_ALT1</name>
                  <description>Selecting Pad: GPIO_AD_B1_03 for Mode: ALT1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_B1_10_ALT1</name>
                  <description>Selecting Pad: GPIO_B1_10 for Mode: ALT1</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
