nxp-mcuxpresso/mcux-soc-svd/MIMXRT1051/MIMXRT1051.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>USBNC2</name>
      <description>USB</description>
      <groupName>USBNC</groupName>
      <prependToName>USBNC_</prependToName>
      <baseAddress>0x402E0004</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x81C</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>USB_OTG2_CTRL</name>
          <description>USB OTG2 Control Register</description>
          <addressOffset>0x800</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x30001000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>OVER_CUR_DIS</name>
              <description>Disable OTG2 Overcurrent Detection</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OVER_CUR_DIS_0</name>
                  <description>Enables overcurrent detection</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OVER_CUR_DIS_1</name>
                  <description>Disables overcurrent detection</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OVER_CUR_POL</name>
              <description>OTG2 Polarity of Overcurrent The polarity of OTG2 port overcurrent event</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OVER_CUR_POL_0</name>
                  <description>High active (high on this signal represents an overcurrent condition)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OVER_CUR_POL_1</name>
                  <description>Low active (low on this signal represents an overcurrent condition)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWR_POL</name>
              <description>OTG2 Power Polarity This bit should be set according to PMIC Power Pin polarity.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PWR_POL_0</name>
                  <description>PMIC Power Pin is Low active.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWR_POL_1</name>
                  <description>PMIC Power Pin is High active.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WIE</name>
              <description>OTG2 Wake-up Interrupt Enable This bit enables or disables the OTG2 wake-up interrupt</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WIE_0</name>
                  <description>Interrupt Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIE_1</name>
                  <description>Interrupt Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WKUP_SW_EN</name>
              <description>OTG2 Software Wake-up Enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WKUP_SW_EN_0</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WKUP_SW_EN_1</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WKUP_SW</name>
              <description>OTG2 Software Wake-up</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WKUP_SW_0</name>
                  <description>Inactive</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WKUP_SW_1</name>
                  <description>Force wake-up</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WKUP_ID_EN</name>
              <description>OTG2 Wake-up on ID change enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WKUP_ID_EN_0</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WKUP_ID_EN_1</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WKUP_VBUS_EN</name>
              <description>OTG2 wake-up on VBUS change enable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WKUP_VBUS_EN_0</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WKUP_VBUS_EN_1</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WKUP_DPDM_EN</name>
              <description>Wake-up on DPDM change enable</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WKUP_DPDM_EN_0</name>
                  <description>DPDM changes wake-up to be disabled only when VBUS is 0.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WKUP_DPDM_EN_1</name>
                  <description>(Default) DPDM changes wake-up to be enabled, it is for device only.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WIR</name>
              <description>OTG2 Wake-up Interrupt Request This bit indicates that a wake-up interrupt request is received on the OTG port</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WIR_0</name>
                  <description>No wake-up interrupt request received</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIR_1</name>
                  <description>Wake-up Interrupt Request received</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_OTG2_PHY_CTRL_0</name>
          <description>OTG2 UTMI PHY Control 0 Register</description>
          <addressOffset>0x818</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x98</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>UTMI_CLK_VLD</name>
              <description>Indicating whether OTG2 UTMI PHY clock is valid</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UTMI_CLK_VLD_0</name>
                  <description>Invalid</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UTMI_CLK_VLD_1</name>
                  <description>Valid</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
