nxp-mcuxpresso/mcux-soc-svd/MIMXRT1051/MIMXRT1051.xml
        <register>
          <name>BMCR1</name>
          <description>Bus (AXI) Master Control Register 1</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WQOS</name>
              <description>Weight of QOS calculation. AXI bus access has AxQOS signal set, which is used as a priority indicator for the associated write or read transaction. A higher value indicates a higher priority transaction. AxQOS is multiplied by WQOS to get weight score.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WAGE</name>
              <description>Weight of AGE calculation. Each command in queue has an age signal to indicate its wait period. It is multiplied by WAGE to get weight score.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WPH</name>
              <description>Weight of Page Hit. This weight score is valid when queue command's page hits current executing command.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRWS</name>
              <description>Weight of slave hit without Read/Write Switch. This weight score is valid when queue command's read/write operation is same as current executing command.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WBR</name>
              <description>Weight of Bank Rotation. This weight score is valid when queue command's bank is not same as current executing command.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BR0</name>
          <description>Base Register 0 (For SDRAM CS0 device)</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x8000001D</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VLD</name>
              <description>Valid</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MS</name>
              <description>Memory size</description>
              <bitOffset>1</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MS_0</name>
                  <description>4KB</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_1</name>
                  <description>8KB</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_2</name>
                  <description>16KB</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_3</name>
                  <description>32KB</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_4</name>
                  <description>64KB</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_5</name>
                  <description>128KB</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_6</name>
                  <description>256KB</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_7</name>
                  <description>512KB</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_8</name>
                  <description>1MB</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_9</name>
                  <description>2MB</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_10</name>
                  <description>4MB</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_11</name>
                  <description>8MB</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_12</name>
                  <description>16MB</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_13</name>
                  <description>32MB</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_14</name>
                  <description>64MB</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_15</name>
                  <description>128MB</description>
                  <value>0xF</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_16</name>
                  <description>256MB</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_17</name>
                  <description>512MB</description>
                  <value>0x11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_18</name>
                  <description>1GB</description>
                  <value>0x12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_19</name>
                  <description>2GB</description>
                  <value>0x13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_20</name>
                  <description>4GB</description>
                  <value>0x14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_21</name>
                  <description>4GB</description>
                  <value>0x15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_22</name>
                  <description>4GB</description>
                  <value>0x16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_23</name>
                  <description>4GB</description>
                  <value>0x17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_24</name>
                  <description>4GB</description>
                  <value>0x18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_25</name>
                  <description>4GB</description>
                  <value>0x19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_26</name>
                  <description>4GB</description>
                  <value>0x1A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_27</name>
                  <description>4GB</description>
                  <value>0x1B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_28</name>
                  <description>4GB</description>
                  <value>0x1C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_29</name>
                  <description>4GB</description>
                  <value>0x1D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_30</name>
                  <description>4GB</description>
                  <value>0x1E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_31</name>
                  <description>4GB</description>
                  <value>0x1F</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BA</name>
              <description>Base Address</description>
              <bitOffset>12</bitOffset>
              <bitWidth>20</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BR1</name>
          <description>Base Register 1 (For SDRAM CS1 device)</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x8400001C</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VLD</name>
              <description>Valid</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MS</name>
              <description>Memory size</description>
              <bitOffset>1</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MS_0</name>
                  <description>4KB</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_1</name>
                  <description>8KB</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_2</name>
                  <description>16KB</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_3</name>
                  <description>32KB</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_4</name>
                  <description>64KB</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_5</name>
                  <description>128KB</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_6</name>
                  <description>256KB</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_7</name>
                  <description>512KB</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_8</name>
                  <description>1MB</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_9</name>
                  <description>2MB</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_10</name>
                  <description>4MB</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_11</name>
                  <description>8MB</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_12</name>
                  <description>16MB</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_13</name>
                  <description>32MB</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_14</name>
                  <description>64MB</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_15</name>
                  <description>128MB</description>
                  <value>0xF</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_16</name>
                  <description>256MB</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_17</name>
                  <description>512MB</description>
                  <value>0x11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_18</name>
                  <description>1GB</description>
                  <value>0x12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_19</name>
                  <description>2GB</description>
                  <value>0x13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_20</name>
                  <description>4GB</description>
                  <value>0x14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_21</name>
                  <description>4GB</description>
                  <value>0x15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_22</name>
                  <description>4GB</description>
                  <value>0x16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_23</name>
                  <description>4GB</description>
                  <value>0x17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_24</name>
                  <description>4GB</description>
                  <value>0x18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_25</name>
                  <description>4GB</description>
                  <value>0x19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_26</name>
                  <description>4GB</description>
                  <value>0x1A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_27</name>
                  <description>4GB</description>
                  <value>0x1B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_28</name>
                  <description>4GB</description>
                  <value>0x1C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_29</name>
                  <description>4GB</description>
                  <value>0x1D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_30</name>
                  <description>4GB</description>
                  <value>0x1E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_31</name>
                  <description>4GB</description>
                  <value>0x1F</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BA</name>
              <description>Base Address</description>
              <bitOffset>12</bitOffset>
              <bitWidth>20</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
