nxp-mcuxpresso/mcux-soc-svd/MIMXRT1051/MIMXRT1051.xml
        <register>
          <name>SDRAMCR2</name>
          <description>SDRAM control register 2</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x80000EEE</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SRRC</name>
              <description>Self Refresh Recovery time</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REF2REF</name>
              <description>Refresh to Refresh wait time</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ACT2ACT</name>
              <description>ACT to ACT wait time</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ITO</name>
              <description>SDRAM Idle timeout</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ITO_0</name>
                  <description>IDLE timeout period is 256*Prescale period.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ITO_1</name>
                  <description>IDLE timeout period is ITO*Prescale period.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ITO_2</name>
                  <description>IDLE timeout period is ITO*Prescale period.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ITO_3</name>
                  <description>IDLE timeout period is ITO*Prescale period.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ITO_4</name>
                  <description>IDLE timeout period is ITO*Prescale period.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ITO_5</name>
                  <description>IDLE timeout period is ITO*Prescale period.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ITO_6</name>
                  <description>IDLE timeout period is ITO*Prescale period.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ITO_7</name>
                  <description>IDLE timeout period is ITO*Prescale period.</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ITO_8</name>
                  <description>IDLE timeout period is ITO*Prescale period.</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ITO_9</name>
                  <description>IDLE timeout period is ITO*Prescale period.</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ITO_10</name>
                  <description>IDLE timeout period is ITO*Prescale period.</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ITO_250</name>
                  <description>IDLE timeout period is ITO*Prescale period.</description>
                  <value>0xFA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ITO_251</name>
                  <description>IDLE timeout period is ITO*Prescale period.</description>
                  <value>0xFB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ITO_252</name>
                  <description>IDLE timeout period is ITO*Prescale period.</description>
                  <value>0xFC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ITO_253</name>
                  <description>IDLE timeout period is ITO*Prescale period.</description>
                  <value>0xFD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ITO_254</name>
                  <description>IDLE timeout period is ITO*Prescale period.</description>
                  <value>0xFE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ITO_255</name>
                  <description>IDLE timeout period is ITO*Prescale period.</description>
                  <value>0xFF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SDRAMCR3</name>
          <description>SDRAM control register 3</description>
          <addressOffset>0x4C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x40808000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>REN</name>
              <description>Refresh enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REBL</name>
              <description>Refresh burst length</description>
              <bitOffset>1</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>REBL_0</name>
                  <description>1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REBL_1</name>
                  <description>2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REBL_2</name>
                  <description>3</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REBL_3</name>
                  <description>4</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REBL_4</name>
                  <description>5</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REBL_5</name>
                  <description>6</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REBL_6</name>
                  <description>7</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REBL_7</name>
                  <description>8</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRESCALE</name>
              <description>Prescaler timer period</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PRESCALE_0</name>
                  <description>256*16 clock cycles</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRESCALE_1</name>
                  <description>PRESCALE*16 clock cycles</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRESCALE_2</name>
                  <description>PRESCALE*16 clock cycles</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRESCALE_3</name>
                  <description>PRESCALE*16 clock cycles</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRESCALE_4</name>
                  <description>PRESCALE*16 clock cycles</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRESCALE_5</name>
                  <description>PRESCALE*16 clock cycles</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRESCALE_6</name>
                  <description>PRESCALE*16 clock cycles</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRESCALE_7</name>
                  <description>PRESCALE*16 clock cycles</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRESCALE_8</name>
                  <description>PRESCALE*16 clock cycles</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRESCALE_9</name>
                  <description>PRESCALE*16 clock cycles</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRESCALE_10</name>
                  <description>PRESCALE*16 clock cycles</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRESCALE_250</name>
                  <description>PRESCALE*16 clock cycles</description>
                  <value>0xFA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRESCALE_251</name>
                  <description>PRESCALE*16 clock cycles</description>
                  <value>0xFB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRESCALE_252</name>
                  <description>PRESCALE*16 clock cycles</description>
                  <value>0xFC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRESCALE_253</name>
                  <description>PRESCALE*16 clock cycles</description>
                  <value>0xFD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRESCALE_254</name>
                  <description>PRESCALE*16 clock cycles</description>
                  <value>0xFE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRESCALE_255</name>
                  <description>PRESCALE*16 clock cycles</description>
                  <value>0xFF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RT</name>
              <description>Refresh timer period</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RT_0</name>
                  <description>256*Prescaler period</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RT_1</name>
                  <description>RT*Prescaler period</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RT_2</name>
                  <description>RT*Prescaler period</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RT_3</name>
                  <description>RT*Prescaler period</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RT_4</name>
                  <description>RT*Prescaler period</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RT_5</name>
                  <description>RT*Prescaler period</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RT_6</name>
                  <description>RT*Prescaler period</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RT_7</name>
                  <description>RT*Prescaler period</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RT_8</name>
                  <description>RT*Prescaler period</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RT_9</name>
                  <description>RT*Prescaler period</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RT_10</name>
                  <description>RT*Prescaler period</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RT_250</name>
                  <description>RT*Prescaler period</description>
                  <value>0xFA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RT_251</name>
                  <description>RT*Prescaler period</description>
                  <value>0xFB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RT_252</name>
                  <description>RT*Prescaler period</description>
                  <value>0xFC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RT_253</name>
                  <description>RT*Prescaler period</description>
                  <value>0xFD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RT_254</name>
                  <description>RT*Prescaler period</description>
                  <value>0xFE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RT_255</name>
                  <description>RT*Prescaler period</description>
                  <value>0xFF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UT</name>
              <description>Refresh urgent threshold</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UT_0</name>
                  <description>256*Prescaler period</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UT_1</name>
                  <description>UT*Prescaler period</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UT_2</name>
                  <description>UT*Prescaler period</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UT_3</name>
                  <description>UT*Prescaler period</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UT_4</name>
                  <description>UT*Prescaler period</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UT_5</name>
                  <description>UT*Prescaler period</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UT_6</name>
                  <description>UT*Prescaler period</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UT_7</name>
                  <description>UT*Prescaler period</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UT_8</name>
                  <description>UT*Prescaler period</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UT_9</name>
                  <description>UT*Prescaler period</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UT_10</name>
                  <description>UT*Prescaler period</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UT_250</name>
                  <description>UT*Prescaler period</description>
                  <value>0xFA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UT_251</name>
                  <description>UT*Prescaler period</description>
                  <value>0xFB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UT_252</name>
                  <description>UT*Prescaler period</description>
                  <value>0xFC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UT_253</name>
                  <description>UT*Prescaler period</description>
                  <value>0xFD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UT_254</name>
                  <description>UT*Prescaler period</description>
                  <value>0xFE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UT_255</name>
                  <description>UT*Prescaler period</description>
                  <value>0xFF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
