nxp-mcuxpresso/mcux-soc-svd/MIMXRT1051/MIMXRT1051.xml
        <register>
          <name>SM1CTRL</name>
          <description>Control Register</description>
          <addressOffset>0x66</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x400</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>DBLEN</name>
              <description>Double Switching Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DBLEN_0</name>
                  <description>Double switching disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DBLEN_1</name>
                  <description>Double switching enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DBLX</name>
              <description>PWMX Double Switching Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DBLX_0</name>
                  <description>PWMX double pulse disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DBLX_1</name>
                  <description>PWMX double pulse enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LDMOD</name>
              <description>Load Mode Select</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LDMOD_0</name>
                  <description>Buffered registers of this submodule are loaded and take effect at the next PWM reload if MCTRL[LDOK] is set.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LDMOD_1</name>
                  <description>Buffered registers of this submodule are loaded and take effect immediately upon MCTRL[LDOK] being set. In this case it is not necessary to set CTRL[FULL] or CTRL[HALF].</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SPLIT</name>
              <description>Split the DBLPWM signal to PWMA and PWMB</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SPLIT_0</name>
                  <description>DBLPWM is not split. PWMA and PWMB each have double pulses.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPLIT_1</name>
                  <description>DBLPWM is split to PWMA and PWMB.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRSC</name>
              <description>Prescaler</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PRSC_0</name>
                  <description>PWM clock frequency = fclk</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRSC_1</name>
                  <description>PWM clock frequency = fclk/2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRSC_2</name>
                  <description>PWM clock frequency = fclk/4</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRSC_3</name>
                  <description>PWM clock frequency = fclk/8</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRSC_4</name>
                  <description>PWM clock frequency = fclk/16</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRSC_5</name>
                  <description>PWM clock frequency = fclk/32</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRSC_6</name>
                  <description>PWM clock frequency = fclk/64</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRSC_7</name>
                  <description>PWM clock frequency = fclk/128</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMPMODE</name>
              <description>Compare Mode</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>COMPMODE_0</name>
                  <description>The VAL* registers and the PWM counter are compared using an &quot;equal to&quot; method. This means that PWM edges are only produced when the counter is equal to one of the VAL* register values. This implies that a PWMA output that is high at the end of a period will maintain this state until a match with VAL3 clears the output in the following period.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMPMODE_1</name>
                  <description>The VAL* registers and the PWM counter are compared using an &quot;equal to or greater than&quot; method. This means that PWM edges are produced when the counter is equal to or greater than one of the VAL* register values. This implies that a PWMA output that is high at the end of a period could go low at the start of the next period if the starting counter value is greater than (but not necessarily equal to) the new VAL3 value.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DT</name>
              <description>Deadtime</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FULL</name>
              <description>Full Cycle Reload</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FULL_0</name>
                  <description>Full-cycle reloads disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FULL_1</name>
                  <description>Full-cycle reloads enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HALF</name>
              <description>Half Cycle Reload</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HALF_0</name>
                  <description>Half-cycle reloads disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HALF_1</name>
                  <description>Half-cycle reloads enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LDFQ</name>
              <description>Load Frequency</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LDFQ_0</name>
                  <description>Every PWM opportunity</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LDFQ_1</name>
                  <description>Every 2 PWM opportunities</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LDFQ_2</name>
                  <description>Every 3 PWM opportunities</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LDFQ_3</name>
                  <description>Every 4 PWM opportunities</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LDFQ_4</name>
                  <description>Every 5 PWM opportunities</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LDFQ_5</name>
                  <description>Every 6 PWM opportunities</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LDFQ_6</name>
                  <description>Every 7 PWM opportunities</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LDFQ_7</name>
                  <description>Every 8 PWM opportunities</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LDFQ_8</name>
                  <description>Every 9 PWM opportunities</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LDFQ_9</name>
                  <description>Every 10 PWM opportunities</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LDFQ_10</name>
                  <description>Every 11 PWM opportunities</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LDFQ_11</name>
                  <description>Every 12 PWM opportunities</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LDFQ_12</name>
                  <description>Every 13 PWM opportunities</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LDFQ_13</name>
                  <description>Every 14 PWM opportunities</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LDFQ_14</name>
                  <description>Every 15 PWM opportunities</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LDFQ_15</name>
                  <description>Every 16 PWM opportunities</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SM1VAL0</name>
          <description>Value Register 0</description>
          <addressOffset>0x6A</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>VAL0</name>
              <description>Value Register 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SM1FRACVAL1</name>
          <description>Fractional Value Register 1</description>
          <addressOffset>0x6C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>FRACVAL1</name>
              <description>Fractional Value 1 Register</description>
              <bitOffset>11</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SM1VAL1</name>
          <description>Value Register 1</description>
          <addressOffset>0x6E</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>VAL1</name>
              <description>Value Register 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SM1FRACVAL2</name>
          <description>Fractional Value Register 2</description>
          <addressOffset>0x70</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>FRACVAL2</name>
              <description>Fractional Value 2</description>
              <bitOffset>11</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SM1VAL2</name>
          <description>Value Register 2</description>
          <addressOffset>0x72</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>VAL2</name>
              <description>Value Register 2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SM1FRACVAL3</name>
          <description>Fractional Value Register 3</description>
          <addressOffset>0x74</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>FRACVAL3</name>
              <description>Fractional Value 3</description>
              <bitOffset>11</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SM1VAL3</name>
          <description>Value Register 3</description>
          <addressOffset>0x76</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>VAL3</name>
              <description>Value Register 3</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SM1FRACVAL4</name>
          <description>Fractional Value Register 4</description>
          <addressOffset>0x78</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>FRACVAL4</name>
              <description>Fractional Value 4</description>
              <bitOffset>11</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SM1VAL4</name>
          <description>Value Register 4</description>
          <addressOffset>0x7A</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>VAL4</name>
              <description>Value Register 4</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SM1FRACVAL5</name>
          <description>Fractional Value Register 5</description>
          <addressOffset>0x7C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>FRACVAL5</name>
              <description>Fractional Value 5</description>
              <bitOffset>11</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SM1VAL5</name>
          <description>Value Register 5</description>
          <addressOffset>0x7E</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>VAL5</name>
              <description>Value Register 5</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SM1FRCTRL</name>
          <description>Fractional Control Register</description>
          <addressOffset>0x80</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>FRAC1_EN</name>
              <description>Fractional Cycle PWM Period Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FRAC1_EN_0</name>
                  <description>Disable fractional cycle length for the PWM period.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FRAC1_EN_1</name>
                  <description>Enable fractional cycle length for the PWM period.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FRAC23_EN</name>
              <description>Fractional Cycle Placement Enable for PWM_A</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FRAC23_EN_0</name>
                  <description>Disable fractional cycle placement for PWM_A.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FRAC23_EN_1</name>
                  <description>Enable fractional cycle placement for PWM_A.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FRAC45_EN</name>
              <description>Fractional Cycle Placement Enable for PWM_B</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FRAC45_EN_0</name>
                  <description>Disable fractional cycle placement for PWM_B.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FRAC45_EN_1</name>
                  <description>Enable fractional cycle placement for PWM_B.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FRAC_PU</name>
              <description>Fractional Delay Circuit Power Up</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FRAC_PU_0</name>
                  <description>Turn off fractional delay logic.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FRAC_PU_1</name>
                  <description>Power up fractional delay logic.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TEST</name>
              <description>Test Status Bit</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
