nxp-mcuxpresso/mcux-soc-svd/MIMXRT1051/MIMXRT1051.xml
        <register>
          <name>CLIDR</name>
          <description>Cache Level ID register</description>
          <addressOffset>0xD78</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CL1</name>
              <description>Indicate the type of cache implemented at level 1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CL1_0</name>
                  <description>No cache</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CL1_1</name>
                  <description>Instruction cache only</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CL1_2</name>
                  <description>Data cache only</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CL1_3</name>
                  <description>Separate instruction and data caches</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CL1_4</name>
                  <description>Unified cache</description>
                  <value>0x4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CL2</name>
              <description>Indicate the type of cache implemented at level 2.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CL2_0</name>
                  <description>No cache</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CL2_1</name>
                  <description>Instruction cache only</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CL2_2</name>
                  <description>Data cache only</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CL2_3</name>
                  <description>Separate instruction and data caches</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CL2_4</name>
                  <description>Unified cache</description>
                  <value>0x4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CL3</name>
              <description>Indicate the type of cache implemented at level 3.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CL3_0</name>
                  <description>No cache</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CL3_1</name>
                  <description>Instruction cache only</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CL3_2</name>
                  <description>Data cache only</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CL3_3</name>
                  <description>Separate instruction and data caches</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CL3_4</name>
                  <description>Unified cache</description>
                  <value>0x4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CL4</name>
              <description>Indicate the type of cache implemented at level 4.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CL4_0</name>
                  <description>No cache</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CL4_1</name>
                  <description>Instruction cache only</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CL4_2</name>
                  <description>Data cache only</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CL4_3</name>
                  <description>Separate instruction and data caches</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CL4_4</name>
                  <description>Unified cache</description>
                  <value>0x4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CL5</name>
              <description>Indicate the type of cache implemented at level 5.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CL5_0</name>
                  <description>No cache</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CL5_1</name>
                  <description>Instruction cache only</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CL5_2</name>
                  <description>Data cache only</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CL5_3</name>
                  <description>Separate instruction and data caches</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CL5_4</name>
                  <description>Unified cache</description>
                  <value>0x4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CL6</name>
              <description>Indicate the type of cache implemented at level 6.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CL6_0</name>
                  <description>No cache</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CL6_1</name>
                  <description>Instruction cache only</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CL6_2</name>
                  <description>Data cache only</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CL6_3</name>
                  <description>Separate instruction and data caches</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CL6_4</name>
                  <description>Unified cache</description>
                  <value>0x4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CL7</name>
              <description>Indicate the type of cache implemented at level 7.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CL7_0</name>
                  <description>No cache</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CL7_1</name>
                  <description>Instruction cache only</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CL7_2</name>
                  <description>Data cache only</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CL7_3</name>
                  <description>Separate instruction and data caches</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CL7_4</name>
                  <description>Unified cache</description>
                  <value>0x4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOUIS</name>
              <description>Level of Unification Inner Shareable for the cache hierarchy. This field is RAZ.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOUIS_0</name>
                  <description>0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOUIS_1</name>
                  <description>1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOUIS_2</name>
                  <description>2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOUIS_3</name>
                  <description>3</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOUIS_4</name>
                  <description>4</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOUIS_5</name>
                  <description>5</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOUIS_6</name>
                  <description>6</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOUIS_7</name>
                  <description>7</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOC</name>
              <description>Level of Coherency for the cache hierarchy</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOC_0</name>
                  <description>0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOC_1</name>
                  <description>1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOC_2</name>
                  <description>2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOC_3</name>
                  <description>3</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOC_4</name>
                  <description>4</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOC_5</name>
                  <description>5</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOC_6</name>
                  <description>6</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOC_7</name>
                  <description>7</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOU</name>
              <description>Level of Unification for the cache hierarchy</description>
              <bitOffset>27</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOU_0</name>
                  <description>0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOU_1</name>
                  <description>1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOU_2</name>
                  <description>2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOU_3</name>
                  <description>3</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOU_4</name>
                  <description>4</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOU_5</name>
                  <description>5</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOU_6</name>
                  <description>6</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOU_7</name>
                  <description>7</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CTR</name>
          <description>Cache Type register</description>
          <addressOffset>0xD7C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x8000C000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IMINLINE</name>
              <description>Log2 of the number of words in the smallest cache line of all the instruction caches that are controlled by the processor.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DMINLINE</name>
              <description>Log2 of the number of words in the smallest cache line of all the data caches and unified caches that are controlled by the processor.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ERG</name>
              <description>Exclusives Reservation Granule. The maximum size of the reservation granule that has been implemented for the Load-Exclusive and Store-Exclusive instructions, encoded as Log2 of the number of words.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CWG</name>
              <description>Cache Write-back Granule. The maximum size of memory that can be overwritten as a result of the eviction of a cache entry that has had a memory location in it modified, encoded as Log2 of the number of words.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FORMAT</name>
              <description>Indicates the implemented CTR format.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FORMAT_4</name>
                  <description>ARMv7 format.</description>
                  <value>0x4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
